// let i=10
// let x=(i==10)? 'верно':'не верно';
// alert(x)

// let mi= prompt('число',0);
// let min = (mi<14) ? 'первая четверть':
// (mi<29) ? 'вторая четверть':
// (mi<44) ? 'третья четверть':
// 'четвёртая четверть';
// alert(min)


// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a==0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a==0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a>0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a<0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a>=0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a<=0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,0,-3',0)
// let z=(a!=0) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между test,тест,3',0)
// let z=(a=='test') ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 1,1,3',1)
// let z=(a=='1') ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 5,0,-3,2',0)
// let z=(a>0 && a<5) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число между 5,0,-3,2',0)
// let z=(a==0 || a==2) ? a+7: a*10;
// alert(z)

// let a= +prompt('выберите число между 1,3,0',0)
// let b= +prompt('выберите число между 6,3,5',3)
// let z=(a<=1 && b>=3) ? a+b: a-b;
// alert(z)

// let a= +prompt('выберите число ',0)
// let b= +prompt('выберите число ',0)
// let z=(a>2 && a<11 || b>=6 && b<14) ? 'верно':'не верно';
// alert(z)

// let a= prompt('выберите число 1,2,3,4',1)
// let z= (a==1) ? 'зима':
// (a==2) ? 'весна':
// (a==3) ? 'лето':
// 'осень'; 
// alert(z)

// let a= prompt('выберите число 1-31',1)
// let z= (a<10) ? 'первая':
// (a<20) ? 'вторая':
// 'третья';
// alert(z)


// let a= prompt('выберите число 1-12',1)
// let z= (a<3) ? 'зима':
// (a<6) ? 'весна':
// (a<9) ? 'лето':
// 'осень'; 
// alert(z)


// let i= ('abcde')
// let z= (i[0]=='a')? 'yes':'no'
// alert(z)

// let i= ('12345')
// let z= (i[0]=='1'||i[0]=='2'||i[0]=='3')? 'yes':'no'
// alert(z)

// let i= ('123')
// let z= (Number(i[0]) + Number(i[1]) + Number(i[2]));
// alert(z)

let i= ('123321')
let z= ((Number(i[0]) + Number(i[1]) + Number(i[2]))==(Number(i[3]) + Number(i[4]) + Number(i[5])))? 'yes':'no'
alert(z)